{"uid": "SKL-SLOZHENIE-091306", "subject_uid": "SUB-MATH", "title": "Сложение", "definition": "Операция, в которой два или более числа объединяются для получения их суммы."}
{"uid": "SKL-RESHENIE-LINEINYH-URAVNE-7bdafb", "subject_uid": "SUB-MATH", "title": "Решение линейных уравнений", "definition": "Процесс нахождения значения переменной, которое делает линейное уравнение истинным."}
{"uid": "SKL-OPREDELENIE-KVADRATNOGO--efe432", "subject_uid": "SUB-MATH", "title": "Определение квадратного уравнения", "definition": "Квадратное уравнение — это уравнение вида ax² + bx + c = 0, где a, b и c — коэффициенты, a ≠ 0."}
{"uid": "SKL-OPREDELENIE-FUNKCII-4a008f", "subject_uid": "SUB-MATH", "title": "Определение функции", "definition": "Функция — это зависимость между двумя переменными, где каждой первой переменной (аргументу) соответствует ровно одна вторая переменная (значение функции)."}
{"uid": "SKL-VYCHITANIE-9ac554", "subject_uid": "SUB-MATH", "title": "Вычитание", "definition": "Операция, в которой одно число вычитается из другого, чтобы получить разность."}
{"uid": "SKL-GRAFICHESKOE-PREDSTAVLEN-763fd3", "subject_uid": "SUB-MATH", "title": "Графическое представление линейных уравнений", "definition": "Способ визуализации линейного уравнения на координатной плоскости, где уравнение представляется в виде прямой линии."}
{"uid": "SKL-FORMULA-DISKRIMINANTA-ecaa2d", "subject_uid": "SUB-MATH", "title": "Формула дискриминанта", "definition": "Дискриминант квадратного уравнения D = b² - 4ac используется для определения количества и типа корней уравнения."}
{"uid": "SKL-GRAFIK-FUNKCII-3a7e5b", "subject_uid": "SUB-MATH", "title": "График функции", "definition": "График функции — это визуальное представление зависимости между переменными, обычно изображаемое в координатной плоскости, где ось X соответствует аргументу, а ось Y — значению функции."}
{"uid": "SKL-UMNOZHENIE-5d6d83", "subject_uid": "SUB-MATH", "title": "Умножение", "definition": "Операция, в которой одно число умножается на другое для получения произведения."}
{"uid": "SKL-METODY-RESHENIYA-KVADRAT-0b5cb3", "subject_uid": "SUB-MATH", "title": "Методы решения квадратных уравнений", "definition": "Существуют различные методы решения квадратных уравнений, включая факторизацию, использование формулы корней и графический метод."}
{"uid": "SKL-SISTEMY-LINEINYH-URAVNEN-87b752", "subject_uid": "SUB-MATH", "title": "Системы линейных уравнений", "definition": "Набор из двух или более линейных уравнений, которые решаются одновременно для нахождения значений переменных, удовлетворяющих всем уравнениям."}
{"uid": "SKL-TIPY-FUNKCII-d79ee5", "subject_uid": "SUB-MATH", "title": "Типы функций", "definition": "Существуют различные типы функций, такие как линейные, квадратичные, экспоненциальные и тригонометрические, каждая из которых имеет свои особенности и графические представления."}
{"uid": "SKL-LINEINYE-URAVNENIYA-e8e41f", "subject_uid": "SUB-MATH", "title": "Линейные уравнения", "definition": "Уравнения, в которых переменные имеют степень 1 и могут быть представлены в виде ax + b = 0, где a и b - константы."}
{"uid": "SKL-METODY-RESHENIYA-SISTEM-ff16c6", "subject_uid": "SUB-MATH", "title": "Методы решения систем", "definition": "Различные подходы к решению систем уравнений, включая метод подстановки, метод исключения и графический метод."}
{"uid": "SKL-PONIMANIE-NERAVENSTV-3d3adf", "subject_uid": "SUB-MATH", "title": "Понимание неравенств", "definition": "Способность интерпретировать и анализировать математические неравенства, включая их графическое представление и свойства."}
{"uid": "SKL-TREUGOLNIK-a58e83", "subject_uid": "SUB-MATH", "title": "Треугольник", "definition": "Плоская геометрическая фигура, состоящая из трех сторон и трех углов."}
{"uid": "SKL-TOCHKA-e7493d", "subject_uid": "SUB-MATH", "title": "Точка", "definition": "Основной элемент геометрии, не имеющий размеров, формы или объема. Точка обозначается обычно заглавной буквой."}
{"uid": "SKL-PRYAMAYA-ee86af", "subject_uid": "SUB-MATH", "title": "Прямая", "definition": "Бесконечная линия, состоящая из множества точек, которая не имеет толщины и продолжается в обе стороны без конца."}
{"uid": "SKL-RESHENIE-NERAVENSTV-8331e0", "subject_uid": "SUB-MATH", "title": "Решение неравенств", "definition": "Навык нахождения решений различных типов неравенств, таких как линейные, квадратные и рациональные неравенства."}
{"uid": "SKL-PRIMENENIE-SISTEM-URAVNE-d83cda", "subject_uid": "SUB-MATH", "title": "Применение систем уравнений", "definition": "Использование систем уравнений для моделирования и решения реальных задач, таких как экономика, физика и инженерия."}
{"uid": "SKL-PRIMENENIE-NERAVENSTV-V--408e2d", "subject_uid": "SUB-MATH", "title": "Применение неравенств в задачах", "definition": "Умение применять неравенства для решения практических задач, включая оптимизацию и анализ данных."}
{"uid": "SKL-PLOSKOST-3c37e3", "subject_uid": "SUB-MATH", "title": "Плоскость", "definition": "Двумерная поверхность, которая простирается в бесконечность и определяется тремя неколлинеарными точками."}
{"uid": "SKL-KVADRAT-55a103", "subject_uid": "SUB-MATH", "title": "Квадрат", "definition": "Плоская фигура с четырьмя равными сторонами и четырьмя прямыми углами."}
{"uid": "SKL-PONIMANIE-OBEMNYH-FIGUR-69ac5d", "subject_uid": "SUB-MATH", "title": "Понимание объемных фигур", "definition": "Способность различать и описывать основные объемные фигуры, такие как куб, параллелепипед, сфера, цилиндр и конус."}
{"uid": "SKL-KRUG-8ab25f", "subject_uid": "SUB-MATH", "title": "Круг", "definition": "Плоская фигура, состоящая из всех точек, находящихся на одинаковом расстоянии от центра."}
{"uid": "SKL-TEOREMA-PIFAGORA-484393", "subject_uid": "SUB-MATH", "title": "Теорема Пифагора", "definition": "В прямоугольном треугольнике квадрат длины гипотенузы равен сумме квадратов длин катетов."}
{"uid": "SKL-VYCHISLENIE-OBEMA-01df60", "subject_uid": "SUB-MATH", "title": "Вычисление объема", "definition": "Навык вычисления объема различных объемных фигур с использованием соответствующих формул."}
{"uid": "SKL-POVOROT-FIGUR-55a261", "subject_uid": "SUB-MATH", "title": "Поворот фигур", "definition": "Изменение положения фигуры в пространстве вокруг заданной точки, сохраняя её форму и размеры."}
{"uid": "SKL-SRAVNENIE-OBEMOV-77196a", "subject_uid": "SUB-MATH", "title": "Сравнение объемов", "definition": "Умение сравнивать объемы различных фигур и определять, какая из них больше или меньше."}
{"uid": "SKL-TEOREMA-O-SUMME-UGLOV-TR-280feb", "subject_uid": "SUB-MATH", "title": "Теорема о сумме углов треугольника", "definition": "Сумма внутренних углов любого треугольника равна 180 градусам."}
{"uid": "SKL-MASSHTABIROVANIE-FIGUR-bd3796", "subject_uid": "SUB-MATH", "title": "Масштабирование фигур", "definition": "Изменение размера фигуры путем увеличения или уменьшения всех её линейных размеров относительно заданного центра масштабирования."}
{"uid": "SKL-PLOSKIE-FIGURY-7a1e37", "subject_uid": "SUB-MATH", "title": "Плоские фигуры", "definition": "Изучение свойств и характеристик фигур, таких как треугольники, квадраты, круги и многоугольники, включая их периметры, площади и углы."}
{"uid": "SKL-TEOREMA-O-PARALLELNYH-PR-fbdba0", "subject_uid": "SUB-MATH", "title": "Теорема о параллельных прямых", "definition": "Если две параллельные прямые пересечены третьей прямой, то углы, образованные этими прямыми, имеют определенные равенства."}
{"uid": "SKL-SDVIG-FIGUR-82450a", "subject_uid": "SUB-MATH", "title": "Сдвиг фигур", "definition": "Перемещение фигуры в пространстве на заданное расстояние в определенном направлении без изменения её формы и размеров."}
{"uid": "SKL-PROSTRANSTVENNYE-FIGURY-98c8b6", "subject_uid": "SUB-MATH", "title": "Пространственные фигуры", "definition": "Анализ трехмерных объектов, таких как кубы, сферы, цилиндры и пирамиды, включая их объемы, площади поверхностей и взаимное расположение."}
{"uid": "SKL-SINUS-2c1d42", "subject_uid": "SUB-MATH", "title": "Синус", "definition": "Синус угла в прямоугольном треугольнике равен отношению длины противолежащей стороны к длине гипотенузы."}
{"uid": "SKL-TEOREMA-PIFAGORA-30defa", "subject_uid": "SUB-MATH", "title": "Теорема Пифагора", "definition": "Основная теорема в геометрии, утверждающая, что в прямоугольном треугольнике квадрат гипотенузы равен сумме квадратов катетов."}
{"uid": "SKL-KOSINUS-ca3614", "subject_uid": "SUB-MATH", "title": "Косинус", "definition": "Косинус угла в прямоугольном треугольнике равен отношению длины прилежащей стороны к длине гипотенузы."}
{"uid": "SKL-ARKSINUS-b62817", "subject_uid": "SUB-MATH", "title": "Арксинус", "definition": "Обратная функция к синусу, определяющая угол, значение синуса которого равно заданному числу."}
{"uid": "SKL-OSNOVNYE-TRIGONOMETRICHE-bc5d9f", "subject_uid": "SUB-MATH", "title": "Основные тригонометрические тождества", "definition": "Тригонометрические тождества, которые связывают основные функции синуса, косинуса и тангенса, такие как sin²(x) + cos²(x) = 1."}
{"uid": "SKL-TANGENS-eeb943", "subject_uid": "SUB-MATH", "title": "Тангенс", "definition": "Тангенс угла в прямоугольном треугольнике равен отношению длины противолежащей стороны к длине прилежащей стороны."}
{"uid": "SKL-ARKKOSINUS-9d91e1", "subject_uid": "SUB-MATH", "title": "Арккосинус", "definition": "Обратная функция к косинусу, определяющая угол, значение косинуса которого равно заданному числу."}
{"uid": "SKL-RESHENIE-TRIGONOMETRICHE-74efc0", "subject_uid": "SUB-MATH", "title": "Решение тригонометрических уравнений", "definition": "Процесс нахождения всех углов, для которых тригонометрическое уравнение выполняется, с использованием тригонометрических идентичностей и свойств функций."}
{"uid": "SKL-TOZHDESTVA-SLOZHENIYA-UG-acb894", "subject_uid": "SUB-MATH", "title": "Тождества сложения углов", "definition": "Тригонометрические тождества, которые описывают синусы и косинусы суммы и разности углов, например, sin(a ± b) = sin(a)cos(b) ± cos(a)sin(b)."}
{"uid": "SKL-ARKTANGENS-2520b6", "subject_uid": "SUB-MATH", "title": "Арктангенс", "definition": "Обратная функция к тангенсу, определяющая угол, значение тангенса которого равно заданному числу."}
{"uid": "SKL-PERIODICHNOST-TRIGONOMET-f6b4d2", "subject_uid": "SUB-MATH", "title": "Периодичность тригонометрических функций", "definition": "Свойство тригонометрических функций, согласно которому значения функции повторяются через определенные интервалы, что позволяет находить бесконечное количество решений уравнений."}
{"uid": "SKL-OPREDELENIE-UGLOV-TREUGO-ed1252", "subject_uid": "SUB-MATH", "title": "Определение углов треугольника", "definition": "Использование тригонометрических функций для вычисления углов в треугольниках, основанное на соотношениях между сторонами и углами."}
{"uid": "SKL-TOZHDESTVA-DVOINOGO-UGLA-18ea2f", "subject_uid": "SUB-MATH", "title": "Тождества двойного угла", "definition": "Тригонометрические тождества, которые позволяют выразить функции угла, равного удвоенному значению другого угла, например, sin(2x) = 2sin(x)cos(x)."}
{"uid": "SKL-METODY-PREOBRAZOVANIYA-T-f83b99", "subject_uid": "SUB-MATH", "title": "Методы преобразования тригонометрических уравнений", "definition": "Использование различных алгебраических и тригонометрических преобразований для упрощения уравнений и облегчения их решения."}
{"uid": "SKL-PLOSCHAD-TREUGOLNIKA-a533ae", "subject_uid": "SUB-MATH", "title": "Площадь треугольника", "definition": "Применение формул, основанных на тригонометрии, для вычисления площади треугольников, включая использование синуса угла между двумя сторонами."}
{"uid": "SKL-SINUS-9990b3", "subject_uid": "SUB-MATH", "title": "Синус", "definition": "Синус угла в круговой системе координат определяется как отношение длины противолежащего катета к длине гипотенузы в прямоугольном треугольнике."}
{"uid": "SKL-OPREDELENIE-PREDELA-POSL-ec6638", "subject_uid": "SUB-MATH", "title": "Определение предела последовательности", "definition": "Предел последовательности - это значение, к которому стремится последовательность при бесконечном увеличении номера её членов."}
{"uid": "SKL-TRIGONOMETRICHESKIE-URAV-07c4f3", "subject_uid": "SUB-MATH", "title": "Тригонометрические уравнения", "definition": "Решение геометрических задач с помощью тригонометрических уравнений, позволяющее находить неизвестные стороны и углы в различных фигурах."}
{"uid": "SKL-KOSINUS-28ca9b", "subject_uid": "SUB-MATH", "title": "Косинус", "definition": "Косинус угла в круговой системе координат определяется как отношение длины прилежащего катета к длине гипотенузы в прямоугольном треугольнике."}
{"uid": "SKL-OPREDELENIE-PREDELA-FUNK-293ab5", "subject_uid": "SUB-MATH", "title": "Определение предела функции", "definition": "Предел функции в точке - это значение, к которому стремится функция при приближении аргумента к данной точке."}
{"uid": "SKL-SVOISTVA-PREDELOV-POSLED-c45b1f", "subject_uid": "SUB-MATH", "title": "Свойства пределов последовательностей", "definition": "Пределы последовательностей обладают рядом свойств, таких как линейность, ограниченность и устойчивость к операциям с последовательностями."}
{"uid": "SKL-TANGENS-54ade2", "subject_uid": "SUB-MATH", "title": "Тангенс", "definition": "Тангенс угла в круговой системе координат определяется как отношение синуса угла к косинусу угла, что также эквивалентно отношению длины противолежащего катета к длине прилежащего катета."}
{"uid": "SKL-SVOISTVA-PREDELOV-8f90b8", "subject_uid": "SUB-MATH", "title": "Свойства пределов", "definition": "Пределы функций обладают рядом свойств, таких как линейность, произведение и частное, которые позволяют упрощать вычисления."}
{"uid": "SKL-OPREDELENIE-NEPRERYVNOST-7060d2", "subject_uid": "SUB-MATH", "title": "Определение непрерывности функции", "definition": "Функция называется непрерывной в точке, если предел функции в этой точке равен значению функции в этой точке."}
{"uid": "SKL-KRITERII-SHODIMOSTI-POSL-196c0c", "subject_uid": "SUB-MATH", "title": "Критерии сходимости последовательностей", "definition": "Существуют различные критерии, позволяющие определить, сходится ли последовательность к пределу, например, критерий Коши."}
{"uid": "SKL-METODY-VYCHISLENIYA-PRED-a2cbd7", "subject_uid": "SUB-MATH", "title": "Методы вычисления пределов", "definition": "Существуют различные методы вычисления пределов, включая подстановку, правило Лопиталя и разложение в ряд Тейлора."}
{"uid": "SKL-TIPY-NEPRERYVNOSTI-a561c6", "subject_uid": "SUB-MATH", "title": "Типы непрерывности", "definition": "Существуют разные типы непрерывности: непрерывность в точке, непрерывность на отрезке и непрерывность на множестве."}
{"uid": "SKL-PONYATIE-PROIZVODNOI-3e3dcf", "subject_uid": "SUB-MATH", "title": "Понятие производной", "definition": "Производная функции в точке — это предел отношения приращения функции к приращению аргумента, когда последнее стремится к нулю."}
{"uid": "SKL-SVOISTVA-NEPRERYVNYH-FUN-3431f8", "subject_uid": "SUB-MATH", "title": "Свойства непрерывных функций", "definition": "Непрерывные функции обладают рядом свойств, таких как сохранение промежуточных значений и возможность интегрирования на заданном интервале."}
{"uid": "SKL-PRAVILA-DIFFERENCIROVANI-0d0e09", "subject_uid": "SUB-MATH", "title": "Правила дифференцирования", "definition": "Существуют основные правила дифференцирования, такие как правило суммы, произведения, частного и цепное правило, которые позволяют находить производные сложных функций."}
{"uid": "SKL-OPREDELENNYI-INTEGRAL-7c2d77", "subject_uid": "SUB-MATH", "title": "Определенный интеграл", "definition": "Определенный интеграл функции на заданном интервале представляет собой предел суммы площадей под графиком функции, когда количество подынтервалов стремится к бесконечности."}
{"uid": "SKL-OPREDELENIE-RYADA-77ce1e", "subject_uid": "SUB-MATH", "title": "Определение ряда", "definition": "Ряд — это сумма последовательности чисел, называемых членами ряда. Формально, ряд может быть представлен в виде S = a_1 + a_2 + a_3 + ... + a_n, где a_i — это члены последовательности."}
{"uid": "SKL-NEOPREDELENNYI-INTEGRAL-51ff51", "subject_uid": "SUB-MATH", "title": "Неопределенный интеграл", "definition": "Неопределенный интеграл функции представляет собой семейство всех первообразных этой функции и обозначается символом ∫f(x)dx."}
{"uid": "SKL-PRIMENENIE-PROIZVODNYH-e7e36b", "subject_uid": "SUB-MATH", "title": "Применение производных", "definition": "Производные используются для нахождения экстремумов функций, анализа их поведения и решения задач оптимизации."}
{"uid": "SKL-SHODIMOST-RYADA-c330be", "subject_uid": "SUB-MATH", "title": "Сходимость ряда", "definition": "Ряд называется сходящимся, если его частичные суммы стремятся к конечному пределу при увеличении числа членов ряда. Если этого не происходит, ряд называется расходящимся."}
{"uid": "SKL-SREDNEE-ARIFMETICHESKOE-1c91df", "subject_uid": "SUB-MATH", "title": "Среднее арифметическое", "definition": "Среднее арифметическое - это сумма всех значений выборки, деленная на количество значений. Оно используется для определения центральной тенденции данных."}
{"uid": "SKL-METOD-PODSTANOVKI-9ba91f", "subject_uid": "SUB-MATH", "title": "Метод подстановки", "definition": "Метод подстановки — это техника интегрирования, которая позволяет упростить интеграл, заменяя переменную интегрирования на другую переменную, что делает интеграл более удобным для вычисления."}
{"uid": "SKL-KRITERII-SHODIMOSTI-a32d06", "subject_uid": "SUB-MATH", "title": "Критерии сходимости", "definition": "Существуют различные критерии сходимости рядов, такие как критерий сравнения, критерий Даламбера (или критерий отношения), и критерий Коши, которые помогают определить, сходится ли ряд."}
{"uid": "SKL-MEDIANA-4123a4", "subject_uid": "SUB-MATH", "title": "Медиана", "definition": "Медиана - это значение, которое делит упорядоченный набор данных на две равные части. Она используется для определения центральной тенденции, особенно в случае, когда данные имеют выбросы."}
{"uid": "SKL-NORMALNOE-RASPREDELENIE-b320c4", "subject_uid": "SUB-MATH", "title": "Нормальное распределение", "definition": "Нормальное распределение — это вероятностное распределение, характеризующееся симметричной колоколоподобной формой, где значения сосредоточены вокруг среднего значения и уменьшаются по мере удаления от него."}
{"uid": "SKL-SREDNEE-ZNACHENIE-098487", "subject_uid": "SUB-MATH", "title": "Среднее значение", "definition": "Среднее значение — это сумма всех значений переменной, деленная на количество этих значений. Этот показатель используется для определения центральной тенденции данных."}
{"uid": "SKL-FORMULIROVANIE-GIPOTEZ-0164a9", "subject_uid": "SUB-MATH", "title": "Формулирование гипотез", "definition": "Способность четко и ясно формулировать гипотезы, которые могут быть проверены с помощью экспериментов или наблюдений."}
{"uid": "SKL-BINOMIALNOE-RASPREDELENI-692ba8", "subject_uid": "SUB-MATH", "title": "Биномиальное распределение", "definition": "Биномиальное распределение описывает количество успехов в фиксированном числе независимых испытаний, каждое из которых имеет два возможных исхода (успех или неудача) с постоянной вероятностью успеха."}
{"uid": "SKL-STANDARTNOE-OTKLONENIE-e6e448", "subject_uid": "SUB-MATH", "title": "Стандартное отклонение", "definition": "Стандартное отклонение - это мера разброса значений в выборке относительно среднего арифметического. Оно показывает, насколько сильно значения отклоняются от среднего."}
{"uid": "SKL-MEDIANA-457791", "subject_uid": "SUB-MATH", "title": "Медиана", "definition": "Медиана — это значение, которое делит набор данных на две равные части, когда данные упорядочены. Если количество наблюдений четное, медиана вычисляется как среднее двух центральных значений."}
{"uid": "SKL-PUASSONOVSKOE-RASPREDELE-4a1380", "subject_uid": "SUB-MATH", "title": "Пуассоновское распределение", "definition": "Пуассоновское распределение используется для моделирования количества событий, происходящих в фиксированном интервале времени или пространства, при условии, что эти события происходят с известной средней частотой и независимо друг от друга."}
{"uid": "SKL-DIZAIN-EKSPERIMENTA-c30e6e", "subject_uid": "SUB-MATH", "title": "Дизайн эксперимента", "definition": "Навык разработки и планирования экспериментов, которые позволяют проверить гипотезы, включая выбор методов, инструментов и контрольных групп."}
{"uid": "SKL-MODA-3184b2", "subject_uid": "SUB-MATH", "title": "Мода", "definition": "Мода — это значение, которое встречается наиболее часто в наборе данных. Набор данных может иметь одну моду (одномодальный), несколько мод (мультимодальный) или не иметь мод вовсе."}
{"uid": "SKL-ANALIZ-DANNYH-47ab23", "subject_uid": "SUB-MATH", "title": "Анализ данных", "definition": "Умение собирать, обрабатывать и интерпретировать данные, полученные в результате экспериментов, для оценки подтверждения или опровержения гипотез."}
{"uid": "SKL-KORRELYACIYA-ce129e", "subject_uid": "SUB-MATH", "title": "Корреляция", "definition": "Корреляция - это статистическая мера, которая описывает степень и направление взаимосвязи между двумя переменными. Она может быть положительной, отрицательной или нулевой."}
{"uid": "SKL-SLOZHENIE-aa811e", "subject_uid": "SUB-MATH", "title": "Сложение", "definition": "Операция, в результате которой два или более чисел объединяются для получения их суммы."}
{"uid": "SKL-OPREDELENIE-KVADRATNOGO--8b2611", "subject_uid": "SUB-MATH", "title": "Определение квадратного уравнения", "definition": "Квадратное уравнение — это уравнение вида ax² + bx + c = 0, где a, b и c — коэффициенты, a ≠ 0."}
{"uid": "SKL-OPREDELENIE-FUNKCII-978b96", "subject_uid": "SUB-MATH", "title": "Определение функции", "definition": "Функция - это зависимость между двумя переменными, при которой каждому значению одной переменной (аргументу) соответствует ровно одно значение другой переменной (функции)."}
{"uid": "SKL-RESHENIE-LINEINYH-URAVNE-aa3482", "subject_uid": "SUB-MATH", "title": "Решение линейных уравнений", "definition": "Процесс нахождения значения переменной, при котором линейное уравнение становится истинным."}
{"uid": "SKL-LINEINAYA-REGRESSIYA-c004f3", "subject_uid": "SUB-MATH", "title": "Линейная регрессия", "definition": "Линейная регрессия - это метод статистического анализа, который используется для моделирования зависимости одной переменной от другой с помощью линейной функции."}
{"uid": "SKL-OCENKA-RISKOV-56e69c", "subject_uid": "SUB-MATH", "title": "Оценка рисков", "definition": "Использование теории вероятностей для оценки и управления рисками в бизнесе и финансах, позволяющее принимать обоснованные решения на основе вероятностных моделей."}
{"uid": "SKL-VYCHITANIE-382bec", "subject_uid": "SUB-MATH", "title": "Вычитание", "definition": "Операция, в результате которой одно число вычитается из другого, что приводит к разности."}
{"uid": "SKL-GRAFIK-LINEINOGO-URAVNEN-85344f", "subject_uid": "SUB-MATH", "title": "График линейного уравнения", "definition": "Графическое представление линейного уравнения на координатной плоскости, которое показывает все возможные решения уравнения."}
{"uid": "SKL-KOEFFICIENT-KORRELYACII--0ceaf8", "subject_uid": "SUB-MATH", "title": "Коэффициент корреляции Пирсона", "definition": "Коэффициент корреляции Пирсона - это числовая мера, которая quantifies степень линейной зависимости между двумя переменными, принимая значения от -1 до 1."}
{"uid": "SKL-GRAFIK-FUNKCII-b2e38c", "subject_uid": "SUB-MATH", "title": "График функции", "definition": "График функции - это визуальное представление зависимости между переменными, отображаемое в координатной плоскости, где ось X представляет аргументы, а ось Y - значения функции."}
{"uid": "SKL-FORMULA-DISKRIMINANTA-818df4", "subject_uid": "SUB-MATH", "title": "Формула дискриминанта", "definition": "Дискриминант квадратного уравнения D = b² - 4ac позволяет определить количество и тип корней уравнения."}
{"uid": "SKL-STATISTICHESKII-ANALIZ-29e3a0", "subject_uid": "SUB-MATH", "title": "Статистический анализ", "definition": "Применение вероятностных методов для анализа данных, выявления закономерностей и прогнозирования будущих событий на основе исторических данных."}
{"uid": "SKL-UMNOZHENIE-0c1a60", "subject_uid": "SUB-MATH", "title": "Умножение", "definition": "Операция, в результате которой одно число умножается на другое, что приводит к произведению."}
{"uid": "SKL-SISTEMY-LINEINYH-URAVNEN-9fd53d", "subject_uid": "SUB-MATH", "title": "Системы линейных уравнений", "definition": "Набор из двух или более линейных уравнений, которые решаются одновременно для нахождения значений переменных, удовлетворяющих всем уравнениям."}
{"uid": "SKL-TIPY-FUNKCII-3d997e", "subject_uid": "SUB-MATH", "title": "Типы функций", "definition": "Существуют различные типы функций, такие как линейные, квадратичные, экспоненциальные и тригонометрические, каждая из которых имеет свои особенности и графические представления."}
{"uid": "SKL-METODY-RESHENIYA-KVADRAT-c6f8e2", "subject_uid": "SUB-MATH", "title": "Методы решения квадратных уравнений", "definition": "Существуют различные методы решения квадратных уравнений, включая факторизацию, использование формулы корней и графический метод."}
{"uid": "SKL-MODELIROVANIE-SLUCHAINYH-c65a16", "subject_uid": "SUB-MATH", "title": "Моделирование случайных процессов", "definition": "Использование теории вероятностей для создания математических моделей, описывающих случайные явления, такие как очереди, финансовые рынки или биологические системы."}
{"uid": "SKL-PONIMANIE-NERAVENSTV-fa7479", "subject_uid": "SUB-MATH", "title": "Понимание неравенств", "definition": "Способность анализировать и интерпретировать математические неравенства, включая их свойства и графическое представление."}
{"uid": "SKL-SLOZHENIE-ALGEBRAICHESKI-b9bf18", "subject_uid": "SUB-MATH", "title": "Сложение алгебраических выражений", "definition": "Процесс объединения двух или более алгебраических выражений путем сложения их соответствующих членов."}
{"uid": "SKL-TOCHKA-08bb9a", "subject_uid": "SUB-MATH", "title": "Точка", "definition": "Основной элемент геометрии, не имеющий размеров, формы или объема. Точка обозначается обычно заглавной буквой."}
{"uid": "SKL-TREUGOLNIK-69b9c0", "subject_uid": "SUB-MATH", "title": "Треугольник", "definition": "Плоская фигура, состоящая из трех сторон и трех углов. Сумма углов треугольника всегда равна 180 градусам."}
{"uid": "SKL-RESHENIE-NERAVENSTV-58996b", "subject_uid": "SUB-MATH", "title": "Решение неравенств", "definition": "Навык нахождения решений неравенств, включая линейные, квадратные и другие типы неравенств."}
{"uid": "SKL-PRYAMAYA-31be63", "subject_uid": "SUB-MATH", "title": "Прямая", "definition": "Бесконечная линия, состоящая из множества точек, которая не имеет толщины и продолжается в обе стороны."}
{"uid": "SKL-UMNOZHENIE-ALGEBRAICHESK-b5e8fd", "subject_uid": "SUB-MATH", "title": "Умножение алгебраических выражений", "definition": "Процесс получения нового алгебраического выражения путем умножения двух или более алгебраических выражений."}
{"uid": "SKL-PRIMENENIE-NERAVENSTV-V--85a8b4", "subject_uid": "SUB-MATH", "title": "Применение неравенств в реальных задачах", "definition": "Умение использовать неравенства для решения практических задач, таких как оптимизация и оценка ресурсов."}
{"uid": "SKL-PLOSKOST-c14a36", "subject_uid": "SUB-MATH", "title": "Плоскость", "definition": "Двумерная поверхность, которая продолжается в бесконечность и не имеет толщины. Плоскость определяется тремя неколлинеарными точками."}
{"uid": "SKL-KVADRAT-f01f16", "subject_uid": "SUB-MATH", "title": "Квадрат", "definition": "Плоская фигура с четырьмя равными сторонами и четырьмя прямыми углами. Площадь квадрата вычисляется как квадрат длины его стороны."}
{"uid": "SKL-FAKTORIZACIYA-ALGEBRAICH-68c1cd", "subject_uid": "SUB-MATH", "title": "Факторизация алгебраических выражений", "definition": "Процесс разложения алгебраического выражения на произведение его множителей."}
{"uid": "SKL-KRUG-bc0664", "subject_uid": "SUB-MATH", "title": "Круг", "definition": "Плоская фигура, состоящая из всех точек, находящихся на одинаковом расстоянии от центра. Площадь круга вычисляется по формуле πr², где r - радиус."}
{"uid": "SKL-PONIMANIE-OBEMNYH-FIGUR-fb39e0", "subject_uid": "SUB-MATH", "title": "Понимание объемных фигур", "definition": "Способность различать и описывать основные объемные фигуры, такие как куб, параллелепипед, сфера, цилиндр и конус."}
{"uid": "SKL-TEOREMA-PIFAGORA-9455ba", "subject_uid": "SUB-MATH", "title": "Теорема Пифагора", "definition": "В прямоугольном треугольнике квадрат длины гипотенузы равен сумме квадратов длин катетов."}
{"uid": "SKL-VYCHISLENIE-OBEMA-f7b902", "subject_uid": "SUB-MATH", "title": "Вычисление объема", "definition": "Навык вычисления объема различных объемных фигур с использованием соответствующих формул."}
{"uid": "SKL-SIMMETRIYA-OTNOSITELNO-O-839b62", "subject_uid": "SUB-MATH", "title": "Симметрия относительно оси", "definition": "Симметрия относительно оси — это свойство фигуры, при котором она остается неизменной при отражении относительно заданной прямой (оси симметрии)."}
{"uid": "SKL-TEOREMA-O-SUMME-UGLOV-TR-7dc85e", "subject_uid": "SUB-MATH", "title": "Теорема о сумме углов треугольника", "definition": "Сумма внутренних углов любого треугольника равна 180 градусам."}
{"uid": "SKL-PLOSKIE-FIGURY-c430b9", "subject_uid": "SUB-MATH", "title": "Плоские фигуры", "definition": "Изучение свойств и характеристик фигур, таких как треугольники, квадраты, круги и многоугольники, на двумерной плоскости."}
{"uid": "SKL-SRAVNENIE-OBEMOV-1bbc60", "subject_uid": "SUB-MATH", "title": "Сравнение объемов", "definition": "Умение сравнивать объемы различных фигур и определять, какая фигура имеет больший или меньший объем."}
{"uid": "SKL-SIMMETRIYA-OTNOSITELNO-T-9f3513", "subject_uid": "SUB-MATH", "title": "Симметрия относительно точки", "definition": "Симметрия относительно точки — это свойство фигуры, при котором каждая точка фигуры имеет соответствующую точку, находящуюся на равном расстоянии от данной точки, но в противоположном направлении."}
{"uid": "SKL-TEOREMA-O-PARALLELNYH-PR-88f4f5", "subject_uid": "SUB-MATH", "title": "Теорема о параллельных прямых", "definition": "Если две параллельные прямые пересечены третьей прямой, то сумма углов, образованных этими прямыми, равна 180 градусам."}
{"uid": "SKL-OBEMNYE-FIGURY-b03f3f", "subject_uid": "SUB-MATH", "title": "Объемные фигуры", "definition": "Анализ свойств трехмерных фигур, таких как кубы, сферы, цилиндры и пирамиды, включая их объем и площадь поверхности."}
{"uid": "SKL-TEOREMY-I-DOKAZATELSTVA-fb5110", "subject_uid": "SUB-MATH", "title": "Теоремы и доказательства", "definition": "Изучение основных теорем геометрии, таких как теорема Пифагора, и методов их доказательства, включая использование аксиом и логических выводов."}
{"uid": "SKL-PREOBRAZOVANIYA-GEOMETRI-12455d", "subject_uid": "SUB-MATH", "title": "Преобразования геометрических фигур", "definition": "Преобразования геометрических фигур — это операции, которые изменяют положение, размер или форму фигур, включая такие виды, как сдвиг, поворот, отражение и масштабирование."}
{"uid": "SKL-SINUS-6d4536", "subject_uid": "SUB-MATH", "title": "Синус", "definition": "Синус угла в прямоугольном треугольнике равен отношению длины противолежащей стороны к длине гипотенузы."}
{"uid": "SKL-KOSINUS-646651", "subject_uid": "SUB-MATH", "title": "Косинус", "definition": "Косинус угла в прямоугольном треугольнике равен отношению длины прилежащей стороны к длине гипотенузы."}
{"uid": "SKL-OSNOVNOE-TRIGONOMETRICHE-eb3f54", "subject_uid": "SUB-MATH", "title": "Основное тригонометрическое тождество", "definition": "Сумма квадратов синуса и косинуса угла равна единице: sin²(θ) + cos²(θ) = 1."}
{"uid": "SKL-ARKSINUS-f1e721", "subject_uid": "SUB-MATH", "title": "Арксинус", "definition": "Обратная функция к синусу, определяющая угол, значение синуса которого равно заданному числу."}
{"uid": "SKL-TANGENS-c975dc", "subject_uid": "SUB-MATH", "title": "Тангенс", "definition": "Тангенс угла в прямоугольном треугольнике равен отношению длины противолежащей стороны к длине прилежащей стороны."}
{"uid": "SKL-RESHENIE-TRIGONOMETRICHE-c45882", "subject_uid": "SUB-MATH", "title": "Решение тригонометрических уравнений", "definition": "Процесс нахождения всех углов, для которых тригонометрическая функция принимает заданное значение."}
{"uid": "SKL-ARKKOSINUS-f42fe8", "subject_uid": "SUB-MATH", "title": "Арккосинус", "definition": "Обратная функция к косинусу, определяющая угол, значение косинуса которого равно заданному числу."}
{"uid": "SKL-TOZHDESTVO-DLYA-SUMMY-UG-5954a7", "subject_uid": "SUB-MATH", "title": "Тождество для суммы углов", "definition": "Синус и косинус суммы двух углов выражаются через синусы и косинусы этих углов: sin(α + β) = sin(α)cos(β) + cos(α)sin(β) и cos(α + β) = cos(α)cos(β) - sin(α)sin(β)."}
{"uid": "SKL-OSNOVNYE-TRIGONOMETRICHE-1601a6", "subject_uid": "SUB-MATH", "title": "Основные тригонометрические идентичности", "definition": "Формулы, которые связывают тригонометрические функции между собой и помогают упростить уравнения."}
{"uid": "SKL-OPREDELENIE-UGLOV-TREUGO-7df970", "subject_uid": "SUB-MATH", "title": "Определение углов треугольника", "definition": "Использование тригонометрических функций для вычисления углов в треугольниках на основе известных сторон."}
{"uid": "SKL-TOZHDESTVO-DLYA-RAZNOSTI-b15057", "subject_uid": "SUB-MATH", "title": "Тождество для разности углов", "definition": "Синус и косинус разности двух углов выражаются через синусы и косинусы этих углов: sin(α - β) = sin(α)cos(β) - cos(α)sin(β) и cos(α - β) = cos(α)cos(β) + sin(α)sin(β)."}
{"uid": "SKL-METODY-RESHENIYA-TRIGONO-d04579", "subject_uid": "SUB-MATH", "title": "Методы решения тригонометрических уравнений", "definition": "Различные подходы, такие как замена переменной, использование графиков и применение идентичностей для нахождения решений."}
{"uid": "SKL-ARKTANGENS-948c99", "subject_uid": "SUB-MATH", "title": "Арктангенс", "definition": "Обратная функция к тангенсу, определяющая угол, значение тангенса которого равно заданному числу."}
{"uid": "SKL-PLOSCHAD-TREUGOLNIKA-607926", "subject_uid": "SUB-MATH", "title": "Площадь треугольника", "definition": "Применение формулы площади треугольника через синус угла и длины сторон для нахождения площади."}
{"uid": "SKL-TRIGONOMETRICHESKIE-URAV-18c811", "subject_uid": "SUB-MATH", "title": "Тригонометрические уравнения", "definition": "Решение геометрических задач с помощью тригонометрических уравнений для нахождения неизвестных величин."}
{"uid": "SKL-OPREDELENIE-PREDELA-POSL-cf365e", "subject_uid": "SUB-MATH", "title": "Определение предела последовательности", "definition": "Предел последовательности — это значение, к которому стремится последовательность при бесконечном увеличении номера её элемента."}
{"uid": "SKL-SINUS-4e70d6", "subject_uid": "SUB-MATH", "title": "Синус", "definition": "Синус угла в прямоугольном треугольнике равен отношению длины противолежащей стороны к длине гипотенузы."}
{"uid": "SKL-OPREDELENIE-NEPRERYVNOST-856960", "subject_uid": "SUB-MATH", "title": "Определение непрерывности функции", "definition": "Функция называется непрерывной в точке, если предел функции в этой точке равен значению функции в этой точке."}
{"uid": "SKL-SVOISTVA-PREDELOV-POSLED-3ee339", "subject_uid": "SUB-MATH", "title": "Свойства пределов последовательностей", "definition": "Пределы последовательностей обладают рядом свойств, таких как линейность, ограниченность и теорема о пределе суммы."}
{"uid": "SKL-KOSINUS-975a57", "subject_uid": "SUB-MATH", "title": "Косинус", "definition": "Косинус угла в прямоугольном треугольнике равен отношению длины прилежащей стороны к длине гипотенузы."}
{"uid": "SKL-TIPY-NEPRERYVNOSTI-0d52ce", "subject_uid": "SUB-MATH", "title": "Типы непрерывности", "definition": "Существуют разные типы непрерывности: непрерывность в точке, непрерывность на отрезке и непрерывность на множестве."}
{"uid": "SKL-PROIZVODNAYA-FUNKCII-ee2b73", "subject_uid": "SUB-MATH", "title": "Производная функции", "definition": "Производная функции в точке — это предел отношения приращения функции к приращению аргумента при стремлении последнего к нулю. Она показывает скорость изменения функции в данной точке."}
{"uid": "SKL-TANGENS-7c65e3", "subject_uid": "SUB-MATH", "title": "Тангенс", "definition": "Тангенс угла в прямоугольном треугольнике равен отношению длины противолежащей стороны к длине прилежащей стороны."}
{"uid": "SKL-SVOISTVA-NEPRERYVNYH-FUN-8e99b8", "subject_uid": "SUB-MATH", "title": "Свойства непрерывных функций", "definition": "Непрерывные функции обладают рядом свойств, таких как сохранение промежуточных значений и возможность интегрирования на заданном интервале."}
{"uid": "SKL-KRITERII-SHODIMOSTI-POSL-d7a07a", "subject_uid": "SUB-MATH", "title": "Критерии сходимости последовательностей", "definition": "Существуют различные критерии, позволяющие определить, сходится ли последовательность к пределу, например, критерий Коши."}
{"uid": "SKL-PRAVILA-DIFFERENCIROVANI-ee5117", "subject_uid": "SUB-MATH", "title": "Правила дифференцирования", "definition": "Существуют различные правила дифференцирования, такие как правило суммы, произведения, частного и цепное правило, которые позволяют находить производные сложных функций."}
{"uid": "SKL-PRIMENENIE-PROIZVODNYH-136451", "subject_uid": "SUB-MATH", "title": "Применение производных", "definition": "Производные используются для нахождения экстремумов функций, анализа их поведения, а также в задачах оптимизации и в физике для описания движения."}
{"uid": "SKL-OPREDELENNYI-INTEGRAL-128e41", "subject_uid": "SUB-MATH", "title": "Определенный интеграл", "definition": "Определенный интеграл представляет собой предел суммы площадей под кривой функции на заданном интервале и используется для вычисления площади, объема и других физических величин."}
{"uid": "SKL-SHODYASCHIISYA-RYAD-7d8ba0", "subject_uid": "SUB-MATH", "title": "Сходящийся ряд", "definition": "Ряд называется сходящимся, если сумма его членов стремится к конечному числу при увеличении числа членов ряда."}
{"uid": "SKL-PONYATIE-FUNKCII-NESKOLK-ecb0e3", "subject_uid": "SUB-MATH", "title": "Понятие функции нескольких переменных", "definition": "Функция нескольких переменных — это функция, которая принимает более одной переменной в качестве аргументов и возвращает одно значение, зависящее от этих переменных."}
{"uid": "SKL-DIVERGENTNYI-RYAD-e54273", "subject_uid": "SUB-MATH", "title": "Дивергентный ряд", "definition": "Ряд называется дивергентным, если сумма его членов не стремится к конечному числу, а уходит в бесконечность или колеблется."}
{"uid": "SKL-NEOPREDELENNYI-INTEGRAL-b7ab37", "subject_uid": "SUB-MATH", "title": "Неопределенный интеграл", "definition": "Неопределенный интеграл функции является семейством всех первообразных этой функции и обозначается знаком интеграла без пределов, отражая процесс нахождения функции, производная которой равна данной."}
{"uid": "SKL-CHASTNYE-PROIZVODNYE-93bdd4", "subject_uid": "SUB-MATH", "title": "Частные производные", "definition": "Частная производная функции нескольких переменных — это производная функции по одной из переменных, при этом остальные переменные считаются постоянными."}
{"uid": "SKL-SREDNEE-ZNACHENIE-5f1855", "subject_uid": "SUB-MATH", "title": "Среднее значение", "definition": "Среднее значение - это сумма всех значений, деленная на количество значений. Оно используется для определения центральной тенденции данных."}
{"uid": "SKL-KRITERII-SRAVNENIYA-0403ad", "subject_uid": "SUB-MATH", "title": "Критерий сравнения", "definition": "Критерий сравнения используется для определения сходимости ряда, сравнивая его с другим рядом, чья сходимость известна."}
{"uid": "SKL-PRIMENENIE-INTEGRALOV-V--0e9296", "subject_uid": "SUB-MATH", "title": "Применение интегралов в физике", "definition": "Интегралы широко применяются в физике для решения задач, связанных с нахождением работы, энергии, центров масс и других величин, зависящих от непрерывных распределений."}
{"uid": "SKL-GRADIENT-FUNKCII-56d2a7", "subject_uid": "SUB-MATH", "title": "Градиент функции", "definition": "Градиент функции нескольких переменных — это вектор, который содержит все частные производные функции и указывает направление наибольшего увеличения функции."}
{"uid": "SKL-MEDIANA-dc91cd", "subject_uid": "SUB-MATH", "title": "Медиана", "definition": "Медиана - это значение, которое делит набор данных на две равные части. Она используется для определения центрального значения, особенно в случае асимметричных распределений."}
{"uid": "SKL-STANDARTNOE-OTKLONENIE-62d016", "subject_uid": "SUB-MATH", "title": "Стандартное отклонение", "definition": "Стандартное отклонение - это мера разброса значений в наборе данных относительно среднего значения. Оно показывает, насколько сильно значения отклоняются от среднего."}
{"uid": "SKL-NORMALNOE-RASPREDELENIE-278a6a", "subject_uid": "SUB-MATH", "title": "Нормальное распределение", "definition": "Нормальное распределение — это вероятностное распределение, которое описывает множество природных явлений и характеризуется симметричной колоколообразной формой, определяемой средним значением и стандартным отклонением."}
{"uid": "SKL-SREDNEE-ARIFMETICHESKOE-94812f", "subject_uid": "SUB-MATH", "title": "Среднее арифметическое", "definition": "Среднее арифметическое — это сумма всех значений выборки, деленная на количество этих значений. Этот показатель используется для определения центральной тенденции данных."}
{"uid": "SKL-FORMULIROVANIE-GIPOTEZ-fa774b", "subject_uid": "SUB-MATH", "title": "Формулирование гипотез", "definition": "Навык, позволяющий четко и ясно формулировать гипотезы, которые можно проверить с помощью экспериментов или исследований."}
{"uid": "SKL-BINOMIALNOE-RASPREDELENI-f151ee", "subject_uid": "SUB-MATH", "title": "Биномиальное распределение", "definition": "Биномиальное распределение описывает количество успехов в фиксированном числе независимых испытаний, каждое из которых имеет два возможных исхода (успех или неудача) с постоянной вероятностью успеха."}
{"uid": "SKL-MEDIANA-d96f93", "subject_uid": "SUB-MATH", "title": "Медиана", "definition": "Медиана — это значение, которое делит упорядоченный набор данных на две равные части. Она используется для оценки центральной тенденции, особенно в случаях, когда данные содержат выбросы."}
{"uid": "SKL-KORRELYACIYA-d94997", "subject_uid": "SUB-MATH", "title": "Корреляция", "definition": "Корреляция - это статистическая мера, которая описывает степень и направление взаимосвязи между двумя переменными. Она может быть положительной, отрицательной или нулевой."}
{"uid": "SKL-SBOR-DANNYH-a11ac7", "subject_uid": "SUB-MATH", "title": "Сбор данных", "definition": "Навык сбора и анализа данных, необходимых для проверки гипотез, включая выбор методов и инструментов для получения достоверной информации."}
{"uid": "SKL-MODA-255812", "subject_uid": "SUB-MATH", "title": "Мода", "definition": "Мода — это значение, которое встречается в наборе данных наиболее часто. Этот показатель помогает определить наиболее распространенные значения в выборке."}
{"uid": "SKL-PUASSONOVSKOE-RASPREDELE-f2899d", "subject_uid": "SUB-MATH", "title": "Пуассоновское распределение", "definition": "Пуассоновское распределение используется для моделирования количества событий, происходящих в фиксированном интервале времени или пространства, при условии, что эти события происходят с известной средней частотой и независимо друг от друга."}
{"uid": "SKL-ANALIZ-REZULTATOV-2d82d5", "subject_uid": "SUB-MATH", "title": "Анализ результатов", "definition": "Навык интерпретации результатов экспериментов и исследований, позволяющий делать выводы о подтверждении или опровержении гипотез."}
{"uid": "SKL-REGRESSIONNYI-ANALIZ-6c0fc3", "subject_uid": "SUB-MATH", "title": "Регрессионный анализ", "definition": "Регрессионный анализ - это метод статистического анализа, который используется для моделирования и анализа взаимосвязи между зависимой переменной и одной или несколькими независимыми переменными."}
{"uid": "SKL-OSNOVY-TEORII-VEROYATNOS-a90daf", "subject_uid": "SUB-MATH", "title": "Основы теории вероятностей", "definition": "Изучение основных понятий теории вероятностей, таких как случайные события, вероятностные пространства и аксиомы вероятности."}
{"uid": "SKL-KOEFFICIENT-KORRELYACII-a93b8c", "subject_uid": "SUB-MATH", "title": "Коэффициент корреляции", "definition": "Коэффициент корреляции - это числовая мера, которая quantifies степень корреляции между двумя переменными, принимая значения от -1 до 1, где -1 указывает на идеальную отрицательную корреляцию, 1 - на идеальную положительную, а 0 - на отсутствие корреляции."}
{"uid": "SKL-MODELIROVANIE-SLUCHAINYH-ba0fe7", "subject_uid": "SUB-MATH", "title": "Моделирование случайных процессов", "definition": "Применение теории вероятностей для моделирования и анализа случайных процессов, таких как игры, финансовые рынки и природные явления."}
{"uid": "SKL-STATISTICHESKII-ANALIZ-D-b05eaa", "subject_uid": "SUB-MATH", "title": "Статистический анализ данных", "definition": "Использование методов теории вероятностей для анализа и интерпретации статистических данных, включая оценку параметров и проверку гипотез."}
